package com.lobinary.设计模式.建造者模式.套餐;

import com.lobinary.设计模式.建造者模式.食品.冷饮.实现类.可口可乐;
import com.lobinary.设计模式.建造者模式.食品.冷饮.实现类.美年达;
import com.lobinary.设计模式.建造者模式.食品.汉堡.实现类.吉士汉堡;
import com.lobinary.设计模式.建造者模式.食品.汉堡.实现类.香辣鸡腿煲;

public class 套餐生成器 {

	public 套餐 辣堡可乐套餐(){
		套餐 辣堡可乐套餐 = new 套餐();
		辣堡可乐套餐.套餐名称 = "辣堡可乐套餐";
		辣堡可乐套餐.添加食品(new 香辣鸡腿煲());
		辣堡可乐套餐.添加食品(new 可口可乐());
		return 辣堡可乐套餐;
	}
	
	public 套餐 吉士美年达套餐(){
		套餐 吉士美年达套餐 = new 套餐();
		吉士美年达套餐.套餐名称 = "吉士美年达套餐";
		吉士美年达套餐.添加食品(new 吉士汉堡());
		吉士美年达套餐.添加食品(new 美年达());
		return 吉士美年达套餐;
	}

}
